<?php
namespace App\Http\Service;

class ReturnMsg{
    public static $msgMap = [
        '0' => 'ok',
        /*token验证*/
        '-1000'      =>  '账号过期，请重新登录',
        '-1001'      =>  '您已在其他账号中登录',
        '-1002'      =>  '数据异常，请重新登录',
        /*登录*/
        '1001'      =>  '账号或密码格式不正确',
        '1002'      =>  '没有注册！',
        '1003'      =>  '账号密码不正确！',
        /**商品**/
        '1004'      =>  '商品类型信息必填！',
        '1005'      =>  '商品类型名称已存在',
        '1006'      =>  '商品父类不存在',
        '1007'      =>  '类型添加失败！',
        '1008'      =>  '类型不存在！',
        '1009'      =>  '数据和原来一致，请修改数据！',
        '1010'      =>  '类型修改失败',
        '1011'      =>  '存在子类型不能删除，请先删除子类型',
        '1012'      =>  '类型删除失败',
        '1013'      =>  '属性已存在',
        '1014'      =>  '属性添加失败',
        '1015'      =>  '属性值已存在',
        '1016'      =>  '属性值添加失败',
        '1017'      =>  '属性值不存在',
        '1018'      =>  '属性值删除失败',
        '1019'      =>  '商品类型不存在',
        '1020'      =>  '属性不存在',
        /*分页规则**/
        '-1003'      =>  '分页数据有错误！',

    ];


    /**
     *获取标准提示信息
     */
    public static function getMsg($code, $others = []){
        $error = [
            'code' => $code,
            'msg' => self::$msgMap[$code]
        ];

        if(is_array($others) && !empty($others)){
            $error = array_merge($error, $others);
        }
        return $error;
    }


}
